Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/using.tmx
Source language: en
Languages: pt

source: Command line and environment
pt: Linha de comando e ambiente

source: The CPython interpreter scans the command line and the environment for various settings.
pt: O interpretador CPython varre a linha de comando e o ambiente em busca de diversas configurações.

source: Other implementations' command line schemes may differ. See :ref:`implementations` for further resources.
pt: Outras implementações de esquemas de linha de comando podem diferir. Veja :ref: `implementations` para mais informações.

source: Command line
pt: Linha de comando

source: When invoking Python, you may specify any of these options::
pt: Quando chamar o Python, você pode especificar qualquer uma dessas opções:

source: python [-bBdEhiOsSuvVWx?] [-c command | -m module-name | script | - ] [args]
pt: python [-bBdEhiOsSuvVWx?] [-c comando | -m nome-do-modulo | script | - ] [argumentos]

source: The most common use case is, of course, a simple invocation of a script::
pt: O caso de uso mais comum é, naturalmente, a simples invocação de um script::

source: python myscript.py
pt: python meu_script.py

source: Interface options
pt: Opções de Interface

source: The interpreter interface resembles that of the UNIX shell, but provides some additional methods of invocation:
pt: A interface do interpretador se parece com a do UNIX, no entanto, provê alguns métodos adicionais para chamada.

source: When called with standard input connected to a tty device, it prompts for commands and executes them until an EOF (an end-of-file character, you can produce that with *Ctrl-D* on UNIX or *Ctrl-Z, Enter* on Windows) is read.
pt: Quando chamado por uma entrada padrão conectada a um dispositivo tty, ele solicita comandos e os executa até um EOF (character de final de arquivo, você pode produzir isso com *Ctrl-D* em UNIX ou *Ctrl-Z, Enter* em Windows) ser lido.

source: When called with a file name argument or with a file as standard input, it reads and executes a script from that file.
pt: Quando chamado com um nome de arquivo como argumento ou com um arquivo com entrada padrão, ele lê e executa o script deste arquivo.

source: When called with a directory name argument, it reads and executes an appropriately named script from that directory.
pt: Quando chamado com um nome de diretório como argumento, ele lê e executa um apropriadamente o nomeado script a partir deste diretório.

source: When called with ``-c command``, it executes the Python statement(s) given as *command*. Here *command* may contain multiple statements separated by newlines. Leading whitespace is significant in Python statements!
pt: Quando chamado com ``-c *comando* ``, ele executa a(s) instrução(ões) Python dada(s) como *comando*. Aqui *comando* pode conter várias instruções separadas por novas linhas. Espaços em branco no início das linhas são significativos nas instruções Python!

source: When called with ``-m module-name``, the given module is located on the Python module path and executed as a script.
pt: Quando chamado com ``-m nome-do-modulo``, o módulo dado é localizado no caminho de módulos Python e executado como um script.

source: In non-interactive mode, the entire input is parsed before it is executed.
pt: No modo não-interativo, a entrada inteira é analisada antes de ser executada.

source: An interface option terminates the list of options consumed by the interpreter, all consecutive arguments will end up in :data:`sys.argv` -- note that the first element, subscript zero (``sys.argv[0]``), is a string reflecting the program's source.
pt: Um opção de interface termina a lista de opções consumida pelo interpretador, todos os argumentos consecutivos acabarão em :data:`sys.argv` -- note que o primeiro argumento, índice zero (``sys.argv[0]``), é a cadeia representado a fonte do programa.

source: Execute the Python code in *command*. *command* can be one ore more statements separated by newlines, with significant leading whitespace as in normal module code.
pt: Executa o código Python em *comando*. *comando* pode ser um ou mais comando separados por newlines, com espaços em branco significativos no início da linha como é normal na codificação de módulo.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-c"`` and the current directory will be added to the start of :data:`sys.path` (allowing modules in that directory to be imported as top level modules).
pt: Se esta opção for fornecida, o primeiro elemento de :data:`sys.argv` será ``"-c"`` e o diretório corrente será acrescentado ao começo do :data:`sys.path` (permitindo que módulos neste diretório sejam importados como módulos de nível principal).

source: Search :data:`sys.path` for the named module and execute its contents as the :mod:`__main__` module.
pt: Procure :data:`sys.path` pelo módulo nomeado e execute seu conteúdo como o módulo :mod:`__main__`.

source: Since the argument is a *module* name, you must not give a file extension (``.py``). The ``module-name`` should be a valid Python module name, but the implementation may not always enforce this (e.g. it may allow you to use a name that includes a hyphen).
pt: Como o argumento é um nome de *módulo*, você não deve dar uma extensão de arquivo (``.py``). O ``nome-de-módulo`` deve ser um nome de módulo Python válido, mas a implementação nem sempre força isso (ex. ele pode permitir que você use um nome que inclui um hífen).

source: Package names are also permitted. When a package name is supplied instead of a normal module, the interpreter will execute ``<pkg>.__main__`` as the main module. This behaviour is deliberately similar to the handling of directories and zipfiles that are passed to the interpreter as the script argument.
pt: Nomes de pacotes também são permitidos. Quanto um nome de pacote é fornecido ao invés de um módulo normal, o interpretador irá executar ``<pkg>.__main__`` como o módulo principal. Este comportamento é deliberadamente similar ao do uso de diretórios e arquivos zipados que são passados para o interpretador como um argumento de script .

source: This option cannot be used with built-in modules and extension modules written in C, since they do not have Python module files. However, it can still be used for precompiled modules, even if the original source file is not available.
pt: Esta opção não pode ser usada com módulos embutidos e módulos de extensão escritos em C, pois eles não tem arquivos de módulo Python. No entanto, ele ainda pode ser usado para módulos pré-compilados, mesmo se o arquivo fonte não estiver disponível.

source: If this option is given, the first element of :data:`sys.argv` will be the full path to the module file. As with the :option:`-c` option, the current directory will be added to the start of :data:`sys.path`.
pt: Se esta opção for fornecida, o primeiro elemento do :data:`sys.argv` será o caminho completo para o arquivo do módulo. Como com a opção :option:`-c`, o diretorio corrente será acrescentado no início do :data:`sys.path`.

source: Many standard library modules contain code that is invoked on their execution as a script. An example is the :mod:`timeit` module::
pt: Vários módulos da biblioteca padrão contem código que é chamado em sua execução como um script. Um exemplo é o módulo :mod:`timeit` ::

source: python -mtimeit -s 'setup here' 'benchmarked code here' python -mtimeit -h # for details
pt: python -mtimeit -s 'especifique aqui' 'código avaliado aqui' python -mtimeit -h # para detalhes

source: See also
pt: Veja também

source: :pep:`338` -- Executing modules as scripts
pt: :pep:`338` -- Executando módulos como scripts

source: Read commands from standard input (:data:`sys.stdin`). If standard input is a terminal, :option:`-i` is implied.
pt: Lê comandos da entrada padrão (:data:`sys.stdin`). Se a entrada padrão é um terminal, :option:`-i` é assumido.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-"`` and the current directory will be added to the start of :data:`sys.path`.
pt: Se está opção é dada, o primeiro elemento do :data:`sys.argv` será ``"-"`` e o diretório corrente será adicionado ao início do :data:`sys.path`.

source: Execute the Python code contained in *script*, which must be a filesystem path (absolute or relative) referring to either a Python file, a directory containing a ``__main__.py`` file, or a zipfile containing a ``__main__.py`` file.
pt: Executa o código Python contido em *script*, que precisa ser um caminho do sistema de arquivos (absoluto ou relativo) se referindo para um arquivo Python, um diretório contendo um arquivo ``__main__.py``, ou um arquivo zipado contendo um arquivo ``__main__.py``.

source: If this option is given, the first element of :data:`sys.argv` will be the script name as given on the command line.
pt: Se esta opção for fornecida, o primeiro elemento da :data:`sys.argv` será o nome do script como fornecido na linha de comando.

source: If the script name refers directly to a Python file, the directory containing that file is added to the start of :data:`sys.path`, and the file is executed as the :mod:`__main__` module.
pt: Se o nome do script se refere diretamente a um arquivo Python, o diretório contendo este arquivo será incluído no início do :data:`sys.path`, e o arquivo é executado como módulo :mod:`__main__`.

source: If the script name refers to a directory or zipfile, the script name is added to the start of :data:`sys.path` and the ``__main__.py`` file in that location is executed as the :mod:`__main__` module.
pt: Se o nome do script se refere a um diretório ou um arquivo zipado, o nome do arquivo é incluído no início do :data:`sys.path` e o arquivo ``__main__.py`` nele localizado é executado como módulo :mod:`__main__` module.

source: If no interface option is given, :option:`-i` is implied, ``sys.argv[0]`` is an empty string (``""``) and the current directory will be added to the start of :data:`sys.path`.
pt: Se nenhuma opção de interface é fornecida, :option:`-i` é assumida, ``sys.argv[0]`` é uma cadeia de caracteres vazia (``""``) e o diretório corrente será incluído no início do :data:`sys.path`.

source: Generic options
pt: Opções Genéricas

source: Print a short description of all command line options.
pt: Imprima uma breve descrição de todas as opções de linha de comando.

source: Print the Python version number and exit. Example output could be::
pt: Imprime o número da versão do Python e sai. Exemplo de saída pode ser::

source: Miscellaneous options
pt: Outras Opções

source: Disable the import of the module :mod:`site` and the site-dependent manipulations of :data:`sys.path` that it entails.
pt: Desabilite o Import do módulo :mod:`site` e as manipulações dependentes do site de :data:`sys.path` que ele implica.

source: Force the binary layer of the stdin, stdout and stderr streams (which is available as their ``buffer`` attribute) to be unbuffered. The text I/O layer will still be line-buffered.
pt: Força a camada binária das cadeias stdin, stdout e stderr (que está disponível como seu atributo ``buffer``) para ser liberado. A camada texto de E/S ainda será mantida no buffer.

source: See also :envvar:`PYTHONUNBUFFERED`.
pt: Veja também :envvar:`PYTHONUNBUFFERED`.

source: Print a message each time a module is initialized, showing the place (filename or built-in module) from which it is loaded. When given twice (:option:`-vv`), print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit. See also :envvar:`PYTHONVERBOSE`.
pt: Imprime uma mensagem cada vez que um módulo é inicializado, exibindo o local (nome do arquivo ou módulo embutido) de onde ele é carregado. Quando duplicado (:option:`-vv`), imprime uma mensagem para cada arquivo pesquisado na busca de um módulo. Também provê informações sobre limpeza do módulo ao sair. Veja também :envvar:`PYTHONVERBOSE`.

source: Warning control. Python's warning machinery by default prints warning messages to :data:`sys.stderr`. A typical warning message has the following form::
pt: Controle de Avisos. O mecanismo de avisos do Python por padrão imprime mensagens de aviso em :data:`sys.stderr`. Uma mensagem de aviso típica tem a seguinte forma::

source: file:line: category: message
pt: arquivo:linha: categoria: mensagem

source: By default, each warning is printed once for each source line where it occurs. This option controls how often warnings are printed.
pt: Por padrão, cada aviso é impresso uma vez para cada linha do fonte onde ele ocorre. Esta opção controla a frequência de impressão do aviso.

source: Multiple :option:`-W` options may be given; when a warning matches more than one option, the action for the last matching option is performed. Invalid :option:`-W` options are ignored (though, a warning message is printed about invalid options when the first warning is issued).
pt: Opções múltiplas :option:`-W` podem ser dadas; quando um aviso casa com mais de uma opção, a ação da última opção casada será executada. Opções invalidas :option:`-W` são ignoradas (embora uma mensagem de aviso seja impressa quando o primeiro aviso é enviado).

source: Warnings can also be controlled from within a Python program using the :mod:`warnings` module.
pt: Avisos podem ser controlador de dentro de um programa Python usando o módulo :mod:`warnings`.

source: The simplest form of argument is one of the following action strings (or a unique abbreviation):
pt: A forma mais simples de argumento é uma das seguintes cadeias de caracteres (ou uma abreviação única)

source: Ignore all warnings.
pt: Ignore todas advertências.

source: Explicitly request the default behavior (printing each warning once per source line).
pt: Explicitamente requisita o comportamento padrão (imprimindo cada advertência por linha de código).

source: Print a warning each time it occurs (this may generate many messages if a warning is triggered repeatedly for the same source line, such as inside a loop).
pt: Imprime uma advertência a cada vez que ela ocorre (isso pode gerar muitas mensagens se a advertência for disparada repetidamente para a mesma linha de código, como dentro de um loop).

source: Print each warning only the first time it occurs in each module.
pt: Imprime cada advertência apenas na primeira vez que ela ocorre em cada módulo.

source: Print each warning only the first time it occurs in the program.
pt: Imprime cada advertência apenas na primeira vez que ela ocorre no programa.

source: Raise an exception instead of printing a warning message.
pt: Lança uma exceção em vez de imprimir uma mensagem de advertência.

source: The full form of argument is::
pt: A forma completa do argumento é::

source: action:message:category:module:line
pt: ação:mensagem:categoria:módulo:linha

source: :pep:`230` -- Warning framework
pt: :pep:`230` -- Advertência do framework

source: Options you shouldn't use
pt: Opções que você não deveria usar

source: Reserved for use by Jython_.
pt: Reservado para uso por Jython_.

source: Reserved for alternative implementations of Python to use for their own purposes.
pt: Reservado para implementaçãoes alternativas do Python para uso dos seus próprios propósitos.

source: Environment variables
pt: Variáveis de ambiente

source: These environment variables influence Python's behavior.
pt: Estas variáveis de ambiente influenciam no comportamento do Python.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-u` option.
pt: Se esta é setada para uma string não nula ela é equivalente a especificar a opção :option:`-u`.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-v` option. If set to an integer, it is equivalent to specifying :option:`-v` multiple times.
pt: Se esta é setada para uma string não nula ela é equivalente a especificar a opção :option:`-v`. Se é setada em um inteiro, ela é equivalente a especificar :option:`-v`múltiplas vezes.

source: If this is set, Python won't try to write ``.pyc`` or ``.pyo`` files on the import of source modules.
pt: se esta é setada, O Python não irá tentar escrever arquivos ``.pyc`` ou ``.pyo`` nos imports de módulos de código.

source: If this is set, Python won't add the user site directory to sys.path
pt: Se esta é setada, Python não irá adicionar o diretório atual do usuário no sys.path

source: Sets the base directory for the user site directory
pt: Seta o diretório base para o diretório atual do usuário

source: This is equivalent to the :option:`-W` option. If set to a comma separated string, it is equivalent to specifying :option:`-W` multiple times.
pt: Isto é equivalente a opção :option:`-W`. Se setado em uma string separada por vírgulas, ela é equivalente a especificar :option:`-W` múltiplas vezes.

source: Debug-mode variables
pt: Variáveis de modo Debug

source: Setting these variables only has an effect in a debug build of Python, that is, if Python was configured with the :option:`--with-pydebug` build option.
pt: Setar estas variáveis somente tem efeito em um build de debug do Python, ou seja, se o Python foi configurado com a opção de build :option:`--with-pydebug`.

source: If set, Python will print memory allocation statistics every time a new object arena is created, and on shutdown.
pt: Se setada, Python imprimirá estatísticas sobre alocação de memória cada vez que uma nova área de objeto é criada, e quando é finalizada.

source: Using Python
pt: Usando Python

source: Using Python on a Macintosh
pt: Usando Python em um Macintosh

source: Author
pt: Autor

source: http://pythonmac.org/packages/ contains selected compiled packages for Python 2.5, 2.4, and 2.3.
pt: http://pythonmac.org/packages/ contém pacotes compilados, selecionados para Python 2.5, 2.4, e 2.3.

source: Packages can be installed via the standard Python distutils mode (``python setup.py install``).
pt: Pacotes podem ser instalados pelo modo padrão distutils Python (``python setup.py install``).

source: Many packages can also be installed via the :program:`setuptools` extension.
pt: Muitos pacotes podem também ser instalados pela extensão :program:`setuptools`.

source: Other Resources
pt: Outros Recursos

source: The MacPython mailing list is an excellent support resource for Python users and developers on the Mac:
pt: A lista de emails MacPython é um excelente recurso de apoio para usuários e desenvolvedores Python no Mac:

source: Another useful resource is the MacPython wiki:
pt: Outro recurso útil é o wiki MacPython:

source: Using Python on Unix platforms
pt: Usando Python em plataformas Unix

source: Getting and installing the latest version of Python
pt: Obtendo e instalando a última versão do Python

source: On Linux
pt: No Linux

source: for Debian users
pt: para usuários Debian

source: for OpenSuse users
pt: para usuários OpenSuse

source: for Fedora users
pt: para usuários Fedora

source: for Slackware users
pt: para usuários Slackware

source: On FreeBSD and OpenBSD
pt: No FreeBSD e OpenBSD

source: FreeBSD users, to add the package use::
pt: Usuários FreeBSD, para adicionar o pacote usar::

source: OpenBSD users use::
pt: Usuários OpenBSD usar::

source: pkg_add ftp://ftp.openbsd.org/pub/OpenBSD/4.2/packages/<insert your architecture here>/python-<version>.tgz
pt: pkg_add ftp://ftp.openbsd.org/pub/OpenBSD/4.2/packages/<insira sua arquitetura aqui>/python-<versão>.tgz

source: Building Python
pt: Construindo Python (Building Python)

source: The build process consists the usual ::
pt: O processo de construção consiste do usual ::

source: For example, on most Linux systems, the default for both is :file:`/usr`.
pt: Por exemplo, na maioria dos sistemas Linux, o padrão para ambos é :file:`/usr`.

source: File/directory
pt: Arquivo/diretório

source: Recommended location of the interpreter.
pt: Localização recomendada do interpretador.

source: To use shell commands in your Python scripts, look at the :mod:`subprocess` module.
pt: Para usar comandos shell nos seus scripts Python, veja o módulo :mod:`subprocess`.

source: Using Python on Windows
pt: Utilizando Python no Windows

source: This document aims to give an overview of Windows-specific behaviour you should know about when using Python on Microsoft Windows.
pt: Este documento objetiva dar uma visão geral dos comportamentos específicos do Windows que você deveria saber quando utilizar Python no Microsoft Windows.

source: Installing Python
pt: Instalando Python

source: Unlike most Unix systems and services, Windows does not require Python natively and thus does not pre-install a version of Python. However, the CPython team has compiled Windows installers (MSI packages) with every `release <http://www.python.org/download/releases/>`_ for many years.
pt: Ao contrário da maioria dos sistemas e serviços Unix, o Windows não requer o Python nativamente e, sendo assim, não pré-instala qualquer versão do Python. Entretanto, o time CPython tem compilado instaladores (pacotes MSI) de `todas as versões do Python, disponíveis em <http://www.python.org/download/releases/>`_ por muitos anos.

source: With ongoing development of Python, some platforms that used to be supported earlier are no longer supported (due to the lack of users or developers). Check :pep:`11` for details on all unsupported platforms.
pt: Com o desenvolvimento contínuo do Python, algumas plataformas que antigamente possuiam suporte hoje não mais possuem (devido à falta de usuários e desenvolvedores). Confira :pep:`11` para obter detalhes sobre todas as plataformas sem suporte.

source: Up to 2.5, Python was still compatible with Windows 95, 98 and ME (but already raised a deprecation warning on installation). For Python 2.6 (and all following releases), this support was dropped and new releases are just expected to work on the Windows NT family.
pt: Até a versão 2.5, o Python ainda continuava compatível com Windows 95, 98 e ME (mas já gerava alertas durante a instalação). Já para o Python2.6 (e todas versões posteriores), esse suporte foi retirado e acredita-se que as novas versões funcionam corretamente na família Windows NT.

source: `Windows CE <http://pythonce.sourceforge.net/>`_ is still supported.
pt: `Windows CE <http://pythonce.sourceforge.net/>`_ ainda é suportado.

source: The `Cygwin <http://cygwin.com/>`_ installer offers to install the `Python interpreter <http://cygwin.com/packages/python>`_ as well; it is located under "Interpreters." (cf. `Cygwin package source <ftp://ftp.uni-erlangen.de/pub/pc/gnuwin32/cygwin/mirrors/cygnus/ release/python>`_, `Maintainer releases <http://www.tishler.net/jason/software/python/>`_)
pt: O instalador `Cygwin <http://cygwin.com/>`_ também oferece a instalação do `interpretador Python <http://cygwin.com/packages/python>`_; esta opção está localizada em "Interpreters." (cf. `pacote fonte do Cygwin <ftp://ftp.uni-erlangen.de/pub/pc/gnuwin32/cygwin/mirrors/cygnus/ release/python>`_, `Versões dos mantenedores <http://www.tishler.net/jason/software/python/>`_)

source: See `Python for Windows (and DOS) <http://www.python.org/download/windows/>`_ for detailed information about platforms with precompiled installers.
pt: Veja `Python para Windows (e DOS) <http://www.python.org/download/windows/>`_ para informações detalhas sobre as plataformas que possuem instaladores pré-compilados.

source: "7 Minutes to "Hello World!"" by Richard Dooling, 2006
pt: "7 minutos para o "Olá Mundo!" (7 Minutes to "Hello World!") de Richard Dooling, 2006

source: in "`Dive into Python: Python from novice to pro <http://diveintopython.org/index.html>`_" by Mark Pilgrim, 2004, ISBN 1-59059-356-1
pt: em "`Mergulhe no Python: Python de novato a profissional (Dive into Python: Python from novice to pro) <http://diveintopython.org/index.html>`_" de Mark Pilgrim, 2004, ISBN 1-59059-356-1
